{
    "intro": {
        "EN": "Hey there, nice to have you here! I've built this small project to introduce myself to you, so let's not waste any time ...",
        "DE": "Hallo, schön, dass Sie hier sind! Mit diesem kleinen Projekt möchte ich mich Ihnen kurz vorstellen, also auf geht's ..."
    },
    "main": [
        {
            "title": {
                "EN": "Some hard facts first...",
                "DE": "Zuerst die harten Fakten ..."
            },
            "body": {
                "EN": "After falling in love with programming at the end of my not-so-very-technical Bachelor studies (linguistics & psychology), I chose a Master's program in 'Linguistics and Web Technology' at the University of Marburg, which I finished in 2015. I then started my career as a fullstack software engineer working on an e-learning platform before joining mgm technology partners, where I have been working as a frontend / fullstack developer for 4.5 years now.",
                "DE": "Nachdem ich mich am Ende meines nicht so technischem Bachelor-Studiums (Sprachwissenschaft & Psychologie) in das Programmieren verliebt habe, habe ich mich für das Masterabschluss 'Linguistics and Web Technology' an der Universität Marburg entschieden, welches ich 2015 abgeschlossen habe. Danach habe ich meinen Berufsweg als Fullstack Software Engineer für eine E-Learning Plattform begonnen, bevor ich zu mgm technology partners gewechselt bin, wo ich nun seit 4,5 Jahren als Frontend / Fullstack Entwicklering tätig bin."
            },
            "icon": "graduation-cap"
        },
        {
            "title": {
                "EN": "... plus some not so hard ones ...",
                "DE": "... und einige nicht ganz harte ..."
            },
            "body": {
                "EN": "Coming from a very different area of study, when I started to teach myself programming, it was like a whole new world opening up to me, and I was surprised to realize it fit me perfectly. I just love the puzzle-solving, abstract thinking, creativity and constant demand to learn new things that programming entails, and the more I learn, the more curious I get about everything that is still out there. Apart from that, I very much enjoy being able to build things that people use, plus the fun it is to work together with talented people to find the best solutions to difficult technical problems.",
                "DE": "Nachdem ich ursprünglich eine völlig andere Disziplin studiert hatte, hat sich das Programmieren für mich, als ich damit anfing, es mir beizubringen, wie eine ganz neue Welt angefühlt, in der ich mich aber - überraschenderweise - pudelwohl gefühlt habe. Ich liebe die Dinge, die das Programmieren von einem fordert, das Puzzeln, das abstrakte Denken, die Kreativität und das ständige Lernen neuer Dinge, und je mehr ich lerne, umso neugieriger werde ich auf all die Dinge, die es noch zu lernen gibt. Außerdem genieße ich es, Dinge zu bauen, die Leute benutzen können, sowie die Freude daran, zusammen mit talentierten Menschen nach den besten Lösungen für schwierige technische Probleme zu suchen."
            },
            "icon": "laptop-code"
        },
        {
            "title": {
                "EN": "... and some very soft ones",
                "DE": "... und noch ein paar ziemlich weiche"
            },
            "body": {
                "EN": "Though you will also find me coding a good part of my free time (you can find some of my side projects on the Projects page), I also love reading, travelling, being out in nature, hiking, biking, and recently also climbing and bouldering. When I am not immersed in a good book or somewhere outside enjoying nature - preferably together with my lovely husband -, I also like to engage in voluntary work at my church or helping refugees finding their way in Germany.",
                "DE": "Obwohl auch ein nicht ganz kleiner Anteil meiner Freizeit mit Programmieren gefüllt ist (einige meiner Nebenprojekte sind auf der Projekte-Seite zu finden), gibt es auch noch ein paar andere Dinge, die mich begeistern - dazu gehören Lesen, Reisen, in der Natur unterwegs sein, Wandern, Rad fahren und neuerdings auch Klettern und Bouldern. Wenn ich nicht gerade in einem guten Buch versunken oder irgendwo draußen unterwegs bin - am liebsten mit meinem wunderbaren Ehemann -, dann verbringe ich auch gern Zeit damit, mich ehrenamtlich in meiner Gemeinde und der Arbeit mit Flüchtlingen zu engagieren."
            },
            "icon": "hiking"
        }
    ],
    "outro": {
        "EN": "... so much for starters, check out the other sections to find out more!",
        "DE": "... genug für den Anfang, mehr Informationen finden Sie auf den weiteren Seiten."
    }
}